In [2]:
import pandas as pd

In [3]:
sku_basic_df = pd.read_csv("../data/jdata_sku_basic_info.csv")
user_action = pd.read_csv("../data/jdata_user_action.csv")
user_basic = pd.read_csv("../data/jdata_user_basic_info.csv")
user_comment_score = pd.read_csv("../data/jdata_user_comment_score.csv")
user_order = pd.read_csv("../data/jdata_user_order.csv")

In [4]:
print(sku_basic_df.shape, user_action.shape, user_basic.shape, user_comment_score.shape, user_order.shape)

(99412, 6) (6944141, 5) (98924, 4) (224284, 4) (792723, 6)

In [5]:
sku_basic_df.head()

   sku_id  price  cate   para_1  para_2  para_3
0       1  364.2    71   247.95      -1      -1
1       2   36.7    46     6.40      -1      -1
2       3  953.3    71   178.92      -1      -1
3       4  110.6    83  6366.88      -1      -1
4       5  241.5    71    31.74      -1      -1

In [6]:
user_action.head()

   user_id  sku_id      a_date  a_num  a_type
0        1   80036  2017-04-14      4       1
1        1   96959  2017-01-12      2       1
2        1    8017  2017-03-09      1       1
3        1   80036  2017-04-30      6       1
4        1   16607  2017-01-12      3       1

In [7]:
user_basic.head()

   user_id  age  sex  user_lv_cd
0        1    3    2           3
1        2    3    2           3
2        3    3    0           5
3        4    3    2           3
4        5    4    2           2